tutorials/Test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       114720;
    }
    atmosphere
    {
        type            patch;
        nFaces          240;
        startFace       114960;
    }
    rightWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          57600;
        startFace       115200;
    }
    leftWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          57600;
        startFace       172800;
    }
    frontAndBack
    {
        type            patch;
        nFaces          480;
        startFace       230400;
    }
)

// ************************************************************************* //
