tutorials/Test/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              1.0e-06;
    rho             2710;
    cp  1127;
    cpsolid 896.0;
    kappa  100.0;
	kappasolid  237.0; 
	Tsolidus 927;
	Tliquidus 945;
    LatentHeat 396666;
    beta    1.0e-5;
}

phase2
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             0.1;
    cp  500;
cpsolid 500;
    kappa  0.016;
kappasolid 0.016;
    Tsolidus    1.0;
    Tliquidus   10.0;
    LatentHeat  1;
    beta    1.0e-5;
}

sigma            0.8;//1.5;
dsigmadT	-0.1e-4;

p0		100000.0;
Tvap 2743.0;
Mm 0.027;
LatentHeatVap 10.518518e6;

// ************************************************************************* //
