tutorials/Test/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

d2dt2Schemes
{
//d2dt2(rho,D) steadyState;
d2dt2(D) steadyState;//Euler;

}
gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)  Gauss linearUpwind grad(U);

    div((interpolate(epsilon1mask)*rhoPhi),U)    Gauss linearUpwind grad(U);

    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phi*cp,Temperature)   Gauss linearUpwind grad(Temperature);

div(rhoPhi,epsilon1)	Gauss linear;//Gauss vanLeer01;

    div((interpolate(cp)*rhoPhi),Temperature)   Gauss upwind;

    div(rhoPhi,Temperature)	Gauss upwind;
    div(phi,Temperature)   Gauss upwind;	
	
     div(phi,epsilon1) Gauss linear;//Gauss vanLeer01;
div(rhoPhi,Le1) Gauss linear;//

div((interpolate(LatentHeat)*rhoPhi),epsilon1)	Gauss vanLeer;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
