tutorials/Test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.phase1.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 3;
        cAlpha          1.0;
	scAlpha		0.5;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.0;//0.005;//0.05;
        smoother        GaussSeidel;//GaussSeidel;//
        nPreSweeps      2;
        nPostSweeps     3;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-9;
            relTol          0;
            nVcycles        5;
            smoother        GaussSeidel;//GaussSeidel;//DICGaussSeidel;//
            nPreSweeps      2;
            nPostSweeps     3;
            nFinestSweeps   2;
            cacheAgglomeration on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-9;
        relTol          0;
        maxIter         25;//20;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-9;
            relTol          0;
            smoother        GaussSeidel;
        }
        tolerance       1e-9;
        relTol          0;
        maxIter         100;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;//GaussSeidel;//DICGaussSeidel;//
        tolerance       1e-9;
        relTol          0.0;//0.1;
        nSweeps         5;//1;
    }

    UFinal
    {
        $U;
        tolerance       1e-9;
        relTol          0;
    }

    Temperature
    {
/*
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        minIter         1;
        maxIter         500;//2
*/
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0.0;
    }

    TemperatureFinal
    {
        $Temperature;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0.0;
    pRefValue       0.0;
}

MELTING
{
    minTempCorrector 1;
    maxTempCorrector 150;
    epsilonTolerance 1e-6;
    epsilonRelaxation 0.95;
    
//	//	Heatsource characteristics
HS_a 0.001;
HS_bg 0.0;//20
HS_velocity 1.0;//6.0;
HS_lg -1e-3;
HS_Q 780.0;//

HS_deposition_cutoff 0.5;

Oscillation_Amplitude   0.0;//0.015;
Oscillation_Frequency   0.0;

Y_R 0.2;//0.05; //Y_R->0 HS -> wider
focY	0.0165; //-0.08;//
foc_shift_vel 0.0;
Q_ramp_rate 7800.0;
tshift 0.25;

damperSwitch false;//true;
}

relaxationFactors
{
}
    "U.*"           0.82;//0.82;//1;
}

// ************************************************************************* //
